[
  {
    "sender": "user",
    "text": "i would like to book a banquet"
  },
  {
    "sender": "assistant",
    "text": "Benvenuto! I’d be delighted to help you arrange a beautiful banquet. What type of event are we celebrating? Is it for a wedding, birthday, a corporate event, or maybe something else?"
  },
  {
    "sender": "user",
    "text": "its a grad party"
  },
  {
    "sender": "assistant",
    "text": "Ah, a graduation party! Congratulazioni! What a wonderful occasion to celebrate! Now, can you please tell me what date you have in mind for this special celebration?"
  },
  {
    "sender": "user",
    "text": "november 1st 2025"
  },
  {
    "sender": "assistant",
    "text": "Perfetto! November 1st, 2025 is going to be a fantastic day for a graduation party! What time are you thinking of starting the festivities?"
  },
  {
    "sender": "user",
    "text": "2 pm and ending at 5 pm"
  },
  {
    "sender": "assistant",
    "text": "Benissimo! A lovely afternoon from 2 PM to 5 PM. Now, how many guests are you expecting to join the celebration?"
  },
  {
    "sender": "user",
    "text": "25"
  },
  {
    "sender": "assistant",
    "text": "Great! So, we’re planning for 25 guests. Now, do you have any specific food preferences or menu requests in mind? Perhaps some favorite dishes or dietary restrictions to consider?"
  },
  {
    "sender": "user",
    "text": "pasta and pizza"
  },
  {
    "sender": "assistant",
    "text": "Ah, pasta and pizza! An excellent choice, very Italian! I can already imagine the delicious spread! Now, may I have your email address so I can send you a confirmation of the booking?"
  },
  {
    "sender": "user",
    "text": "antoniod4421@gmail.com"
  },
  {
    "sender": "assistant",
    "text": "Grazie, Antonio! And just to have all your details, could you please provide your phone number as well?"
  },
  {
    "sender": "user",
    "text": "330-502-9339"
  },
  {
    "sender": "assistant",
    "text": "Perfetto! Here’s what I have for your graduation party:\n\n- **Event Type:** Graduation party\n- **Date:** November 1st, 2025\n- **Time:** 2 PM to 5 PM\n- **Guests:** 25\n- **Menu Preferences:** Pasta and pizza\n- **Email:** antoniod4421@gmail.com\n- **Phone Number:** 330-502-9339\n\nLet me confirm your booking… Everything looks fantastic! I'm sure it will be an unforgettable celebration. If there’s anything else you need in the meantime, feel free to reach out. Can't wait to help you make this occasion special! 🎉🍝🍕"
  }
]